{"company":[{"id":"3","name":"Apigee","summary":"Apigee is a provider of API technology and services for enterprises and developers. Providing a range of solutions from entry level tools for exploring APIs with a console and navigating OAuth, to enterprise tools for managing OAuth, Keys and platform for driving developer adoption while understanding usage, managing traffic and scaling an API platform. Apigee provides solutions for enterprises li","details":"Apigee is a provider of API technology and services for enterprises and developers. Providing a range of solutions from entry level tools for exploring APIs with a console and navigating OAuth, to enterprise tools for managing OAuth, Keys and platform for driving developer adoption while understanding usage, managing traffic and scaling an API platform. Apigee provides solutions for enterprises like Comcast, GameSpy, TransUnion Interactive, Guardian Life and Constant Contact and thousands of developers use Apigee's technology.\nApigee provides resources to help you understand best practices, avoid common pitfalls, develop your strategy, and learn to drive your developer community. Apigee also provides articles, white papers, and other resources to help you deliver your API.","website":"https:\/\/apigee.com","twitter":"https:\/\/twitter.com\/Apigee","github":"https:\/\/github.com\/apigee","blog":"https:\/\/blog.apigee.com\/front","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/apigee-logo.gif","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/3341_apigee_oauth.png","tags":"API Discovery,API Gateway,API Management,Apigee,Authentication,BaaS,Security,Utility","width":"175"},{"id":"95","name":"APIs.io","summary":"APIs.io os an experimental API Search service to help discover APIs on the web. The service uses the APIs.json proposed discovery format. To find APIs type your request in the search box. To get listed follow the instructions in the FAQ. The Search engine is also open source so you can run your own copy.","details":"APIs.io os an experimental API Search service to help discover APIs on the web. The service uses the APIs.json proposed discovery format. To find APIs type your request in the search box. To get listed follow the instructions in the FAQ. The Search engine is also open source so you can run your own copy.","website":"http:\/\/apis.io\/","twitter":"https:\/\/twitter.com\/apisio","github":"https:\/\/github.com\/apisio","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/apis-io.png","screenshot":null,"tags":"API Discovery,API-Discovery,Directory","width":"150"},{"id":"9","name":"Mashape","summary":"Mashape provides tools that enable developers to quickly deliver and consume APIs and offers a marketplace for listing APIs. Mashape provides tools for testing your API, code for generation of custom errors, components for user management and standardized API code language libraries in multiple languages. Once your API is ready for prime time Mashape provides a marketplace for listing your API, le","details":"Mashape provides tools that enable developers to quickly deliver and consume APIs and offers a marketplace for listing APIs. Mashape provides tools for testing your API, code for generation of custom errors, components for user management and standardized API code language libraries in multiple languages. Once your API is ready for prime time Mashape provides a marketplace for listing your API, letting developers to easily discover and begin hacking with your API, in a social API community environment.","website":"http:\/\/mashape.com","twitter":"https:\/\/twitter.com\/mashape","github":"https:\/\/github.com\/Mashape","blog":"http:\/\/blog.mashape.com\/","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/mashape-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Mashape-Screenshot.png","tags":"API Directory,API Discovery,API Integration,API Management,API Operations","width":"175"},{"id":"1","name":"Mashery","summary":"Mashery&rsquo;s API management tools and strategic services help companies connect with customers and partners in a changing digital world by extending reach across devices, markets and the Web. Mashery leads the industry with a holistic approach for API initiatives &ndash; from setting platform strategy and measuring business objectives to the heavy lifting of providing and managing infrastructur","details":"Mashery&rsquo;s API management tools and strategic services help companies connect with customers and partners in a changing digital world by extending reach across devices, markets and the Web. Mashery leads the industry with a holistic approach for API initiatives &ndash; from setting platform strategy and measuring business objectives to the heavy lifting of providing and managing infrastructure to facilitating relationships with our 150,000 strong network of Web and mobile application developers. Having worked with over 100 leading brands to power more than 40,000 apps, Mashery&rsquo;s knowledge, experience and proven strategies enable companies to focus on their core business while driving sales, building new revenue channels and realizing faster time-to-market for innovative applications.\nMashery was founded in 2006 and has built an impressive list of over 150 clients that include Best Buy, Netflix, ESPN, Rdio, D&amp;B, Expedia, Klout, USA TODAY and The New York Times.","website":"http:\/\/mashery.com","twitter":"https:\/\/twitter.com\/Mashery","github":"https:\/\/github.com\/mashery","blog":"http:\/\/www.mashery.com\/blog","blogrss":"http:\/\/feeds.feedburner.com\/MasheryBlog","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/mashery-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/Mashery-Screenshot.png","tags":"API Discovery,API Management,Delyn Simons,Mashery,Oren Michels","width":"150"},{"id":"96","name":"ProgrammableWeb","summary":"ProgrammableWeb is where you stay in tune with what's new and interesting with mashups, Web 2.0 APIs, and the new Web as Platform. The core of the site is the news blog and the 4 dashboards: Home, Mashups, APIs, and Members. New updates every day, 365 days a year.\nProgrammableWeb was the original public, web API directory, providing a growing directory of APIs that every developer has used to disc","details":"ProgrammableWeb is where you stay in tune with what's new and interesting with mashups, Web 2.0 APIs, and the new Web as Platform. The core of the site is the news blog and the 4 dashboards: Home, Mashups, APIs, and Members. New updates every day, 365 days a year.\nProgrammableWeb was the original public, web API directory, providing a growing directory of APIs that every developer has used to discover the APIs they are looking for. \nProgrammableWeb was started in 2005 by John Musser, and sold to Alcatel-Lucent in 2010, then again in 2013 to Mulesoft. ","website":"http:\/\/www.programmableweb.com\/","twitter":"https:\/\/twitter.com\/programmableweb","github":"https:\/\/github.com\/programmableweb","blog":"http:\/\/www.programmableweb.com\/","blogrss":"http:\/\/feeds2.feedburner.com\/programmableweb","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/serviceproviders\/programmable-web-logo.png","screenshot":"http:\/\/kinlane-productions.s3.amazonaws.com\/ap-evangelist-site\/api\/screenshots\/1420_programmableweb.png","tags":"API Directory,API Discovery","width":"150"},{"id":"1918","name":"Public APIs","summary":"We know how hard it is to find great APIs. Sowe builtPublicAPIs.comwhere you can instantly search through thousands of APIs and discover publiccloud web services. By searching through public APIs, developers can save time and energy, easily finding the APIs (software components) they need to quickly create and deliver an application on any platform (Mobile, Web, etc).","details":"We know how hard it is to find great APIs. Sowe builtPublicAPIs.comwhere you can instantly search through thousands of APIs and discover publiccloud web services. By searching through public APIs, developers can save time and energy, easily finding the APIs (software components) they need to quickly create and deliver an application on any platform (Mobile, Web, etc).","website":"http:\/\/publicapis.com\/","twitter":"","github":"","blog":"","blogrss":"","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/public-apis-com-logo.png","screenshot":null,"tags":"API Discovery,API-Discovery,Mashape","width":"200"},{"id":"1687","name":"TheRightAPI","summary":"TheRightAPI allows you to explore APIs, then evaluate information on each API such as cost, terms of use and documentation--then share your feedback with the community by rating and commenting on APIs in their registry.\nDevelopers can try out API usage scenario through test harness or leverage one of the scenarios shared by others in TheRightAPI community. Developers can then automate your tests s","details":"TheRightAPI allows you to explore APIs, then evaluate information on each API such as cost, terms of use and documentation--then share your feedback with the community by rating and commenting on APIs in their registry.\nDevelopers can try out API usage scenario through test harness or leverage one of the scenarios shared by others in TheRightAPI community. Developers can then automate your tests scenarios to run as often as once a minute or as little as once a day based on your subscription, allowing view of activity through charts, then set alerts of any critical errors.","website":"http:\/\/www.therightapi.com\/","twitter":"https:\/\/twitter.com\/rightapi","github":"https:\/\/github.com\/theRightAPI","blog":"http:\/\/blog.therightapi.com","blogrss":"http:\/\/feeds.feedburner.com\/rtur","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/therightapi-logo-2.png","screenshot":null,"tags":"API Discovery,API Integration,API Monitoring,API Operations,API Testing,API-Discovery","width":"225"},{"id":"2211","name":"API Rating Agency","summary":"An API is more than an Application Programming Interface, it&rsquo;s a contract. We curate and provide technical, financial, legal, social and insiders infos about public APIs, to restore trust between developers and API providers.","details":"An API is more than an Application Programming Interface, it&rsquo;s a contract. We curate and provide technical, financial, legal, social and insiders infos about public APIs, to restore trust between developers and API providers.","website":"http:\/\/apiratings.org\/","twitter":"https:\/\/twitter.com\/API500","github":"","blog":"http:\/\/api500.com\/","blogrss":"http:\/\/api500.com\/rss","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/api-rating-agency-logo.png","screenshot":null,"tags":"API Discovery,Rating","width":"150"},{"id":"2948","name":"API Commons","summary":"Provide a simple and transparent mechanism for the copyright free sharing and collaborative design of API specifications, interfaces and data models. Web APIs are fast becoming a critical technology to enable integration between service providers and consumers on the Internet, both in business and public spheres. As the number of APIs increases, so does the potential for innovation in terms of app","details":"Provide a simple and transparent mechanism for the copyright free sharing and collaborative design of API specifications, interfaces and data models. Web APIs are fast becoming a critical technology to enable integration between service providers and consumers on the Internet, both in business and public spheres. As the number of APIs increases, so does the potential for innovation in terms of applications on top of these APIs.","website":"http:\/\/apicommons.org\/","twitter":"https:\/\/twitter.com\/apicommons","github":"","blog":"http:\/\/apicommons.org\/blog\/","blogrss":"http:\/\/feeds.feedburner.com\/apicommons\/eOLA","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/api-commons-logo.png","screenshot":null,"tags":"API Copyright,API Discovery,API-Discovery","width":"150"},{"id":"2949","name":"APIs.json","summary":"APIs are becoming a crucial part of the Web. Unfortunately however, it remains very difficult to determine the location of these APIs on servers around the Web. The only way to discover APIs and their properties is via human driven search through public search engines or in hand curated API Directory listings. While these methods work, neither can scale to the potentially hundreds of thousands and","details":"APIs are becoming a crucial part of the Web. Unfortunately however, it remains very difficult to determine the location of these APIs on servers around the Web. The only way to discover APIs and their properties is via human driven search through public search engines or in hand curated API Directory listings. While these methods work, neither can scale to the potentially hundreds of thousands and millions of APIs which will be published over the next few years.","website":"http:\/\/apisjson.org\/","twitter":"https:\/\/twitter.com\/APIsjson","github":"","blog":"http:\/\/apisjson.org\/blog\/","blogrss":"http:\/\/apisjson.org\/blog.xml","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/company\/logos\/apisdotjson.png","screenshot":null,"tags":"API Discovery","width":"150"}],"published":"06\/15\/2014"}